In [19]:
import pandas as pd
import numpy as np

In [6]:
df1 = pd.DataFrame([['a', 100], ['b', 200]], columns=['name', 'age'])
df2 = pd.DataFrame([['a', 5000]], columns=['name', 'salary'])
df3 = pd.DataFrame([['c', 1000], ['d', 2000]], columns=['name', 'age'])
df4 = pd.DataFrame([['c', 50000]], columns=['name', 'salary'])

In [7]:
dfs = [(df1, df2), (df3, df4)]
def merge_df1_df2(df1, df2):
    df1 = df1.merge(df2, how='left')
    return df1
for dfa, dfb in dfs:
    dfa = merge_df1_df2(dfa, dfb)
df1

  name  age
0    a  100
1    b  200

In [48]:
df = pd.DataFrame({'value': [1, np.nan, np.nan, 2, 3, 1, 3, np.nan, 3], 'name': ['A','A', 'B','B','B','B', 'C','C','C']})
df

   value name
0    1.0    A
1    NaN    A
2    NaN    B
3    2.0    B
4    3.0    B
5    1.0    B
6    3.0    C
7    NaN    C
8    3.0    C

In [49]:
df.groupby("name").transform(lambda x: x.fillna(x.mean()))

   value
0    1.0
1    1.0
2    2.0
3    2.0
4    3.0
5    1.0
6    3.0
7    3.0
8    3.0